---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAnyHandle.StepId
source: html/c405368c-2a81-1fb0-ebf2-341bba7f4346.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.StepId Property

The step id of the handle. Valid only for import.

## Syntax (C#)
```csharp
public int StepId { get; }
```